diagrams/risk.dot
# Overview

digraph G {
   //rankdir=LR;
node [shape=rect,style=filled,fillcolor=yellow];
Thing [fillcolor=none];

Thing -> Risk [taillabel="hasRisk"];
Thing -> Consequence [label="hasConsequence"] ;
Thing -> Impact [label ="hasImpact"];
Thing -> Impact [dir=both,arrowhead=none,label="\n \n hasImpactOn"];
Consequence -> Thing [label="hasConsequenceOn"];
Thing -> Severity [label="hasSeverity         "];
Thing -> Likelihood [label="hasLikelihood             "]
Consequence -> Impact [dir=both,arrowhead=none,arrowtail=onormal];

Risk -> RiskLevel[label="hasRiskLevel"];
Risk -> RiskMitigationMeasure [label="isMitigatedByMeasure"];
Risk -> Risk [label="hasResidualRisk"];
//RiskMitigationMeasure -> Risk [label="mitigatesRisk"];


}
